In [2]:
import csv
import pandas as pd

In [34]:
with open("population.csv","r") as f:
    file=csv.reader(f,delimiter=';')
    with open("pop.csv","w") as f1:
        file1=csv.writer(f1,delimiter=',')
        for line in file:
            file1.writerow(line)

In [160]:
with open("pop2.csv","r") as f:
    file=csv.reader(f,delimiter=',')
    with open("pop3.csv","w") as f1:
        file1=csv.writer(f1,delimiter='-')
        for line in file:
            file1.writerow(line)

In [55]:
df=pd.read_csv('pop.csv',encoding='latin-1')
df.head(5)

    region        subregion             key     value
0     Asia    Southern Asia     Afghanistan  25500100
1   Europe  Northern Europe   Åland Islands     28502
2   Europe  Southern Europe         Albania   2821977
3   Africa  Northern Africa         Algeria  37900000
4  Oceania        Polynesia  American Samoa     55519

In [60]:
df['region'].nunique()

5

In [61]:
df['subregion'].nunique()

22

In [62]:
df['key'].nunique()

250

In [59]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 250 entries, 0 to 249
Data columns (total 4 columns):
region       246 non-null object
subregion    246 non-null object
key          250 non-null object
value        250 non-null int64
dtypes: int64(1), object(3)
memory usage: 4.9+ KB

In [60]:
df.describe()

              value
count  2.500000e+02
mean   2.785678e+07
std    1.209181e+08
min   -1.000000e+00
25%    1.018720e+05
50%    3.729353e+06
75%    1.617672e+07
max    1.361170e+09

In [87]:
df['subregion']=df.subregion.str.replace(' ','_')
df['key']=df.key.str.replace(" ",'_')
df.head(5)

    region        subregion             key     value
0     Asia    Southern_Asia     Afghanistan  25500100
1   Europe  Northern_Europe   Åland_Islands     28502
2   Europe  Southern_Europe         Albania   2821977
3   Africa  Northern_Africa         Algeria  37900000
4  Oceania        Polynesia  American_Samoa     55519

In [13]:
df.sort_values(['region','subregion'],inplace=True)
df.head()

    region       subregion                             key     value
32  Africa  Eastern_Africa  British_Indian_Ocean_Territory        -1
37  Africa  Eastern_Africa                         Burundi  10163000
50  Africa  Eastern_Africa                         Comoros    724300
62  Africa  Eastern_Africa                        Djibouti    864618
69  Africa  Eastern_Africa                         Eritrea   6333000

In [149]:
df.columns

Index(['region', 'subregion', 'key', 'value'], dtype='object')

In [14]:
df.rename(columns={'value':'id',"key":'country',"region":'continent','subregion':"subcontinent"},inplace=True)
df.head(5)

   continent    subcontinent                         country        id
32    Africa  Eastern_Africa  British_Indian_Ocean_Territory        -1
37    Africa  Eastern_Africa                         Burundi  10163000
50    Africa  Eastern_Africa                         Comoros    724300
62    Africa  Eastern_Africa                        Djibouti    864618
69    Africa  Eastern_Africa                         Eritrea   6333000

In [15]:
df1=df.drop('id',axis=1)

In [16]:
df1.head(5)

   continent    subcontinent                         country
32    Africa  Eastern_Africa  British_Indian_Ocean_Territory
37    Africa  Eastern_Africa                         Burundi
50    Africa  Eastern_Africa                         Comoros
62    Africa  Eastern_Africa                        Djibouti
69    Africa  Eastern_Africa                         Eritrea

In [159]:
df1.to_csv("pop2.csv")

In [162]:
df1.index

Int64Index([ 32,  37,  50,  62,  69,  71, 116, 131, 132, 140,
            ...
            175, 192, 225, 226, 232, 245,   8,  30,  79,  97],
           dtype='int64', length=250)

In [8]:
with open ('pop2.csv','r') as f:
    file=csv.reader(f,delimiter=',')
    with open("pop4.csv","w") as f1:
        file1=csv.writer(f1,delimiter='-')
        for line in file:
            del(line[0])
            file1.writerow(line)

In [18]:
df2=pd.read_csv('pop4.csv')

In [19]:
df2.head()

                      continent-subcontinent-country
0  Africa-Eastern_Africa-British_Indian_Ocean_Ter...
1                      Africa-Eastern_Africa-Burundi
2                      Africa-Eastern_Africa-Comoros
3                     Africa-Eastern_Africa-Djibouti
4                      Africa-Eastern_Africa-Eritrea

In [22]:
df3=df['id']

In [28]:
df3.to_csv('pop5.csv')

In [23]:
df3.head(5)

32          -1
37    10163000
50      724300
62      864618
69     6333000
Name: id, dtype: int64

In [29]:
with open ('pop5.csv','r') as f:
    file=csv.reader(f,delimiter=',')
    with open("pop6.csv","w") as f1:
        file1=csv.writer(f1,delimiter=',')
        for line in file:
            del(line[0])
            file1.writerow(line)

In [34]:
df4=pd.read_csv('pop6.csv')

In [35]:
df4.head()

         id
0        -1
1  10163000
2    724300
3    864618
4   6333000

In [44]:
concat=pd.concat([df2,df4],axis=1)

In [45]:
concat.head()

                      continent-subcontinent-country        id
0  Africa-Eastern_Africa-British_Indian_Ocean_Ter...        -1
1                      Africa-Eastern_Africa-Burundi  10163000
2                      Africa-Eastern_Africa-Comoros    724300
3                     Africa-Eastern_Africa-Djibouti    864618
4                      Africa-Eastern_Africa-Eritrea   6333000

In [46]:
concat.rename(columns={'continent-subcontinent-country':'value'},inplace=True)

In [47]:
concat.head()

                                               value        id
0  Africa-Eastern_Africa-British_Indian_Ocean_Ter...        -1
1                      Africa-Eastern_Africa-Burundi  10163000
2                      Africa-Eastern_Africa-Comoros    724300
3                     Africa-Eastern_Africa-Djibouti    864618
4                      Africa-Eastern_Africa-Eritrea   6333000

In [48]:
concat=concat.set_index('value')

In [51]:
concat.head()

                                                          id
value
Africa-Eastern_Africa-British_Indian_Ocean_Terr...        -1
Africa-Eastern_Africa-Burundi                       10163000
Africa-Eastern_Africa-Comoros                         724300
Africa-Eastern_Africa-Djibouti                        864618
Africa-Eastern_Africa-Eritrea                        6333000

In [1]:
concat.to_csv("sunbrust.csv")

NameError: name 'concat' is not defined

In [92]:
df.head()

    region        subregion             key     value
0     Asia    Southern_Asia     Afghanistan  25500100
1   Europe  Northern_Europe   Åland_Islands     28502
2   Europe  Southern_Europe         Albania   2821977
3   Africa  Northern_Africa         Algeria  37900000
4  Oceania        Polynesia  American_Samoa     55519

In [93]:
import random as random
import json

In [94]:
colors = {}
for i in df['key']:
    color = "%06x" % random.randint(0, 0xFFFFFF)
    colors.update({i: "#"+color})

In [77]:
#colors

In [95]:
with open("colors.json", 'w') as fw:
    json.dump(colors,fw)

In [89]:
df['subregion'].unique()

array(['Southern_Asia', 'Northern_Europe', 'Southern_Europe',
       'Northern_Africa', 'Polynesia', 'Middle_Africa', 'Caribbean', nan,
       'South_America', 'Western_Asia', 'Australia_and_New_Zealand',
       'Western_Europe', 'Eastern_Europe', 'Central_America',
       'Western_Africa', 'Northern_America', 'Southern_Africa',
       'Eastern_Africa', 'South-Eastern_Asia', 'Eastern_Asia',
       'Melanesia', 'Micronesia', 'Central_Asia'], dtype=object)

In [90]:
scolors={}
for i in df['subregion'].unique():
    color = "%06x" % random.randint(0, 0xFFFFFF)
    scolors.update({i: "#"+color})

In [91]:
with open("scolors.json", 'w') as fw:
    json.dump(scolors,fw)